rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "rating" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "P"], ["release_date", "1977-05-25 00:00:00.000000"], ["updated_at", "2017-09-26 21:23:55.457533"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def search_directors
    movie = Movie.find(params[:id])
    @movies = Movie.search_directors(movie)

    if @movies.empty?